In [6]:
import pandas as pd

In [7]:
data = {
    'Producto': ['A', 'B', 'C'],
    'Ventas': [250, 150, 300],
    'Ciudad': ['Lima', 'Bogotá', 'Santiago'],
    'Fecha': ['2024-01-01', '2024-02-01', '2024-03-01']
}

df = pd.DataFrame(data)
display(df)

  Producto  Ventas    Ciudad       Fecha
0        A     250      Lima  2024-01-01
1        B     150    Bogotá  2024-02-01
2        C     300  Santiago  2024-03-01

In [8]:
df_reordenado = df[['Fecha', 'Producto', 'Ventas', 'Ciudad']]
display(df_reordenado)

        Fecha Producto  Ventas    Ciudad
0  2024-01-01        A     250      Lima
1  2024-02-01        B     150    Bogotá
2  2024-03-01        C     300  Santiago

In [9]:
df_seleccion = df[['Producto', 'Ventas']]
display(df_seleccion)

  Producto  Ventas
0        A     250
1        B     150
2        C     300

In [13]:
df_loc = df.loc[:, ['Producto', 'Ciudad']]
display(df_loc)

  Producto    Ciudad
0        A      Lima
1        B    Bogotá
2        C  Santiago

In [14]:
df_sin_fecha = df.drop(columns=['Fecha'])
display(df_sin_fecha)

  Producto  Ventas    Ciudad
0        A     250      Lima
1        B     150    Bogotá
2        C     300  Santiago

In [16]:
df[df['Ventas'] > 200][['Producto', 'Ventas']]

  Producto  Ventas
0        A     250
2        C     300

In [17]:
df.loc[df['Ventas'] > 200, ['Producto', 'Ventas']]

  Producto  Ventas
0        A     250
2        C     300